# 说明：此合同适用于产品或产品+实施服务销售的业务模式，请根据合同中的说明进行使用。另外，批注中的说明系为了公司内部正确使用合同，不属于合同条款的一部分，请在发给客户之前，全部删除。
contract_template = """

合     同 
                                           签约地：北京市
                                                          合同号：
需方：（以下简称甲方）
单位名称： 
地址: 
邮编： 
电话： 
传真： 
合同联系人：
合同联系人电话：

供方：（以下简称乙方）
单位名称：北京昆仑联通科技发展股份有限公司
地址: 北京市石景山区和平西路55号院2号楼金安中海财富中心B座6层
邮编：100083
电话：010-52818088
传真：010-64844477
合同联系人：
合同联系人电话：

甲乙双方在本合同生效时均已确定以上涉及到各自公司的信息完全正确。
为保护甲乙双方的合法权益，根据《中华人民共和国民法典》，甲乙双方在平等自愿协商一致的基础上，就购销事宜达成如下协议，共同遵守。

一、	合同标的物
合同标的物内容及价格详见附件一。

二、 合同金额：
合同总金额￥     , 人民币（大写）：     元整。
上述金额为含税金额，其中，不含税金额为￥     ，税率为     ，增值税金额为￥     。此外，甲方知悉本合同货款及服务费以不含税金额为基数，最终合同金额与实时关税及增值税等税费相关，双方一致认可本合同项下的所有税款最终由甲方承担，税款在结算时根据产品的原厂所在国家（或地区）/货物生产国(或地区)存在与本合同约定交付国（或地区）之间的国家最新关税政策规定执行。考虑到贸易政策等不可控因素将导致部分产品因为进出口关税发生变化从而使乙方成本增加，双方一致认可乙方不应因此类变化而受损，甲乙双方同意合同总价款应根据实际发生的关税变化进行相应调整。

三、 甲方付款方式及发票： 
 
付款方式：选择第 _____项

1、合同签订之日起____日内，甲方向乙方支付合同总额的 _____ %做为预付款，即￥     .00元，人民币(大写)：___万 ____仟 ____佰____拾元整。甲方自合同标的物收货之日起    日内甲方向乙方支付合同总额的 _____ %，即￥     .00元，人民币(大写)：___万 ____仟 ____佰____拾元整。
2、自合同标的物货到验收合格之日起____日内，甲方向乙方支付合同总额的___%，即￥     .00元，人民币(大写)：___万 ____仟 ____佰____拾元整，乙方交付同等金额合法发票给甲方。

发票类型：请  √

1、乙方为甲方开具的发票类型如下：
增值税普通发票（13%）[　  ]      增值税普通发票（6%）[　  ]
增值税专用发票（13%）[　  ]      增值税专用发票（6%）[　  ]
    
乙方应向甲方开具符合国家规定的合法发票。
如若因为甲方自身原因导致乙方不能按时提供发票的，甲方的付款时间不受发票开具时间的影响。即：在此种情形下，甲方应视为乙方已（及时）提供发票，甲方应按合同中约定的付款方式及时付款。

2、甲方的开票信息如下: 

单位名称： 
地址: 
电话： 
开户行： 
账号： 
税号：

甲方需确保以上开票信息完全正确。
当由于甲方失误，导致乙方开票错误时，请甲方协助乙方解决发票作废或冲红的相关事宜。
当由于甲方失误，导致乙方发票作废或冲红产生费用时，该费用需由甲方承担。

3、乙方收款信息如下：

单位名称： 
开户行： 
账号： 

四、交货：
1、交货日期
甲乙双方签订合同生效后，乙方在收到甲方支付的预付款 后订货,并在     个工作日内将本合同标的物按下列方式交付甲方。
   双方特别约定：基于是否具备对应的安装调试条件以及培训条件等，为甲方单方可控行为，所以双方一致承诺：对于本合同中所约定的对应阶段（包括但不限于：交货、安装调试、服务、培训等）的完成期限，如到期前甲方未以书面形式通知乙方已经具备相应条件并要求乙方进行对应服务的，视为乙方已经就对应服务内容进行完毕并参照本合同第五条第6款处理。
2、本合同标的物的交付形式为：[　  ]                             
（1）电子邮件形式：
由乙方或厂商直接发送电子邮件至甲方指定邮箱（或最终用户指定邮箱）的邮件为乙方履行交付义务的凭证。甲方收到乙方或厂商电子邮件即为产品交付的完成。
其中微软（中国）有限公司接到乙方订单后，将合同约定产品直接以电子形式放在其官方网站上，最终用户按照微软的电子邮件通知进行注册。微软系统发出到货确认函邮件（Order Confirmation）即为合同的约定产品。乙方无有形实物交付甲方，甲方或最终用户收到微软电子邮件即为产品交付的完成。
（2）纸质授权（license）形式：本合同标的物的交付形式为原厂包装的纸质license，甲方收到乙方或者对应产品生产厂商交付的该纸质license即为交付完成。
（3）有形实物形式：甲方收到乙方交付的本合同标物即为交付完成。
3、双方承诺：本合同标的物的风险自甲方收货之日起转移至甲方。本合同项下标的物为专门为甲方（或甲方指定的最终用户）所订制，不具有转售其他客户的条件，除非货物生产厂商书面同意，否则双方一致认可：本合同约定的所有标的货物不得退货。

五、产品的验收
1、本合同约定产品的验收方式为：[　  ]
（1）甲方应自乙方下单之日起5个工作日内在网上完成产品的验收，并签署乙方提供的货物签收单，以快递或传真等形式回传至乙方。
（2）甲方应在收到标的物的 5 个工作日内完成验收，并签署乙方提供的货物签收单，以快递或传真等方式回传至乙方。
2、甲方如不能按第五条第1款要求签署货物签收单，则应同意乙方给甲方的原始发货记录作为合同项下产品交付完毕的凭证；同时，双方一致认可：甲方要求乙方开具发票的行为，代表乙方对应发票金额的义务已经履约完毕，对于发票所对应金额进入无争议的付款阶段；乙方开具发票的出票行为（包括将发票开给甲方或按甲方要求将发票开给第三方的行为）视为乙方的对应交货和/或服务义务履行完毕。
3、甲方收到标的物后，对于存在异议或认为不符合合同约定的，应在收货10个工作日内向乙方提出书面异议，逾期提出的，视为已经收到本合同项下全部标的物且验收合格。
4、甲方如在异议期内提出的异议成立，乙方负责联系原厂家进行更换；甲方应及时将需要调换的产品退还乙方，乙方在本合同约定的交付时间范围内重新为甲方交付。
5、如乙方在本合同项下存在服务义务（包括但不限于：附件一所载明之服务；此处仅为例举，不代表乙方必然进行前述服务的全部或部分，乙方是否存在服务型义务以及具体服务内容等乙方全部义务仅限于本合同第一条所约定之义务），甲方应在乙方完成服务义务或约定的服务期限到期后5个工作日内完成验收，并在验收合格证明上签字；如果甲方对于乙方所提供服务存在异议，应在乙方完成服务义务或约定的服务期限到期后10个工作日内提出，否则视为验收合格。
6、双方特别约定：基于是否出具书面的验收证明为甲方单方可控行为，所以双方一致承诺：对于本合同中的分段验收的约定，如约定了对应阶段（包括但不限于：交货、安装调试、服务、培训等）完成期限的，在对应阶段完成期限到期后，甲方既未提出书面异议也未提供对应阶段验收证明的视为甲方已经验收完毕。基于服务型义务的特殊性，双方认可：相关服务需由甲方主动发起并进行书面授权，如甲方未出具书面授权申请发起相应服务的，乙方则无法启动服务流程，甲方未发起服务流程的，不视为乙方责任，不影响甲方付款义务。

六、知识产权
1、乙方保证其提供给甲方的产品均已得到原厂的合法授权而在中国大陆地区合法销售，并保证所销售产品均为原厂正版。
2、乙方保证交付的软件均符合原厂所承诺的功能，完成验收即应被视为该许可软件能达到原厂所承诺功能的决定性证据。但本保证不适用于：
（1）甲方或任何第三人对该许可软件作任何方式的修改；
（2）甲方未按许可软件的操作规定使用软件；
（3）由于甲方原因或第三方软件产品的故障、计算机硬件设备故障、网络故障等使软件无法正常运行。

七、保密
1、甲乙双方对在签订和履行本合同过程中从对方获得的技术信息和经营信息（统称商业秘密），具有保密义务。在合同有效期内及合同终止后三年内，未经对方书面同意，均不得以任何方式不当地使用或向任何第三方泄露、出售、出租、转让、许可使用或共享。
2、违反本条约定给对方造成损失的，违约方应负相关的法律责任。

八、违约责任 
		1、甲乙双方应全面实际地履行合同，一方迟延履行合同或履行合同不符合本合同约定的视为违约，违约方应向守约方支付违约金。双方一致认可：本合同所涉及行业的产品贬值迅速且在本合同签约价格中已经充分考虑了相关因素，为了体现对于违约方的惩罚性以及对于意思自治原则的充分尊重，双方一致承诺并保证：守约方已经产生了不少于本合同约定数额的实际损失（例如包括但不限于：资金周转成本、机会成本、催收成本、风险性成本等），违约方认可本合同守约方对于实际损失的举证责任困难，并明确放弃针对违约金过高的所有抗辩权。
		2、乙方未按合同规定的交货日期交货，每延迟一天需按合同总金额的0.3%向甲方交纳违约金。
3、甲方拒绝接受或迟延接受乙方符合合同约定的产品或者甲方未按合同规定的付款日期付款，每延迟一天需按合同总金额的0.3%向乙方支付违约金。 

1、甲乙双方应全面实际地履行合同，一方迟延履行合同或履行合同不符合本合同约定的视为违约，违约方应向守约方支付违约金。双方一致认可：本合同所涉及行业的产品贬值迅速且在本合同签约价格中已经充分考虑了相关因素，为了体现对于违约方的惩罚性以及对于意思自治原则的充分尊重，双方一致承诺并保证：守约方已经产生了不少于本合同约定数额的实际损失（例如包括但不限于：资金周转成本、机会成本、催收成本、风险性成本等），违约方认可本合同守约方对于实际损失的举证责任困难，并明确放弃针对违约金过高的所有抗辩权。
	    2、乙方未按合同规定的日期交货、提供服务，每延迟一天需按合同总金额的0.3%向甲方交纳违约金。
3、甲方拒绝接受或迟延接受乙方符合合同约定的产品、服务或者甲方未按合同规定的付款日期付款，每延迟一天需按合同总金额的0.3%向乙方支付违约金。
4、如因甲方原因（包括但不限于未具备实施服务前的环境条件、调整实施服务项目的内容等）导致乙方延期完成服务的，乙方不承担本条第2款的违约责任。 

九、免责条款
1、乙方对甲方因许可软、硬件遗失、被盗、被误用或被擅自修改、计算机设备故障、第三方软件引起、员工操作失误、网络故障等情况造成的损失，包括但不限于数据丢失、利润损失、丧失商业机会等均不承担赔偿责任。
2、对于因乙方不可控因素导致乙方延期交付、交付不能或继续履行会导致卖方遭受损失的，乙方有权在通知买方后单方解除合同，且不承担违约责任。乙方不可控因素包括但不限于中美贸易战中禁售名单变化、厂商生产物料短缺及不可抗力等。
      
十、不可抗力
1、本合同所指不可抗力系指：地震、风暴、水灾或其他自然灾害、瘟疫、战争、暴乱、敌对行动、公共骚乱、公共敌人的行为、政府或公共机关禁止、国家法律法规变更、政策调整等任何一方不可预见、不可防止和不能避免或克服的事件。双方一致认可当出现关税变化超过10%的情形时等同于不可抗力。
2、由于不可抗力的原因，一方被迫终止或中止合同的执行，受阻方应用电报、传真等书面形式尽快通知对方。
3、受阻方应在不可抗力事件发生30日内，将有关机关证明文件以最快方式邮寄对方。不可抗力事件终止或解除后，应用电报、传真等书面方式尽快通知对方。
4.由于不可抗力致使本合同中止或延迟履行超过30天，双方应通过友好协商解决合同进一步履行问题。

十一、适用法律和法律解释
1、本合同应受中华人民共和国法律管辖。
2、如果本合同所载的任何一个或多个条款在任何方面因任何原因被判决无效、不合法或不可执行，该无效条款不影响本合同其它条款的效力。
3、本合同的各个附件，为本合同不可分割的组成部分，与本合同所列的条款和条件具有同样的约束力和法律效力。但是，如果本合同所列的条款和条件与本合同各个附件（包括一般条款和条件）所列的条款和条件有任何抵触，则应以本合同的条款为准。

十二、争议的解决
甲乙双方应友好协商解决与合同或合同执行有关的任何争议。如未能友好解决，任何一方均可向北京市石景山区人民法院提起诉讼。

十三、其它
1、本合同自双方负责人（代理人）签字并加盖合同章或公章后生效，生效日期为合同中最
	后一个“签字日期”。正本一式二份，甲乙双方各持一份，具有同等的法律效力。
2、任何一方未经另一方书面同意,不得向第三方出示本合同。
3、本合同未尽事宜及合同变更，应以“补充协议”的书面形式签署，由双方负责人（代理人）签字并加盖合同章或公章后生效。
4、一经双方负责人（代理人）签字、盖章,此合同复印件及传真件与合同原件具有同等法律效力。
5、原厂商合规审查条款（非微软软件产品，本条款不适用）
甲方所有与微软软件使用相关的权利和义务均在由甲方与微软（作为原厂商）之间直接订立的微软软件许可协议中明确规定。乙方无权向甲方做出任何与微软软件许可协议条款相冲突的承诺。如甲方与乙方签署的本合同中有任何与微软软件使用相关的权利和义务的相关约定与微软软件许可协议条款不一致的，应以微软软件许可协议条款为准。所有对微软软件许可协议的修改仅在由甲方和微软同意并签署书面修订文件后生效。
“微软软件许可协议”系指微软商业和服务协议、企业协议、选择附加协议和（或）其它相关文档。
微软为本条款的第三方受益人，在微软认为对于维护其在本条款项下的权利必要的范围内，有权直接强制执行本条款。

十四、最终用户（所购标的物使用者）信息（必须全部填写）

法定名称（中文）：
法定名称（英文）
法定地址(中文)：
法定地址(英文)
邮编： 
联系电话/传真： 
联系人姓名： 
联系人Email：
 
关于最终用户信息的说明：
1、以上提供的“最终用户信息”作为乙方向所定购产品的原厂商说明所定产品的最终使用者信息之用；
2、以上“最终用户信息”是由甲方提供并确认，如甲方提供的最终用户信息有误或有漏项，由此产生的一切责任及费用由甲方全部承担。

【以下无正文，为签署页】

甲方：	乙方：北京昆仑联通科技发展股份有限公司

法定代表人/授权代理人：
	
法定代表人/授权代理人：
	
日期：      年    月     日                 日期：        年    月     日



附件一：合同标的物内容及价格清单
产品名称及描述	单位  	数量 	单价（元）	小计（元）
				

	总价	￥0.00

"""

review_key_points = [
"""
合同模版和合同原文的对比
*关键点：需要仔细对比【合同模板】和 【合同原文】的条款内容，确保合同条款的项目没有被整体删除或者被客户添加了他们自己的一些条款。*
*注意：如果合同原文中有删除或添加的条款，请在审核报告中指出，并提供修改建议。*
"""
,
"""
# 一、付款方式

无账期客户（全款预收or预付款不低于30%，且尾款付款周期不超过交货后7天）
有账期客户（付款周期不超过信誉账期，如账期不符合请特批）

条款描述示例如下：
1、合同签订之日起____日内，甲方向乙方支付合同总额的 _____ %做为预付款，即￥     .00元，人民币(大写)：___万 ____仟 ____佰____拾元整。甲方自合同标的物收货之日起    日内甲方向乙方支付合同总额的 _____ %，即￥     .00元，人民币(大写)：___万 ____仟 ____佰____拾元整。 
*关键点： 100%预付情况下，违约责任和争议解决地可以放宽处理*

2、自合同标的物货到验收合格之日起____日内，甲方向乙方支付合同总额的___%，即￥     .00元，人民币(大写)：___万 ____仟 ____佰____拾元整，乙方交付同等金额合法发票给甲方。
""", 
"""
# 二、交货
交货时间：产品不同对应的货期不同，要确保在合同中约定的交货时间内能按时交货。
交货方式：电子邮件形式、纸质授权形式和有形实物形式，根据产品的不同选择不同的交货方式。
不得退货条款。

条款描述示例如下：
1、交货日期
甲乙双方签订合同生效后，乙方在收到甲方支付的预付款后订货,并在     个工作日内将本合同标的物按下列方式交付甲方。
*关键点： 如无预付款，在收到甲方支付的预付款后 此部分需删除*

2、本合同标的物的交付形式为：[　  ]                             
（1）电子邮件形式：
由乙方或厂商直接发送电子邮件至甲方指定邮箱（或最终用户指定邮箱）的邮件为乙方履行交付义务的凭证。甲方收到乙方或厂商电子邮件即为产品交付的完成。
其中微软（中国）有限公司接到乙方订单后，将合同约定产品直接以电子形式放在其官方网站上，最终用户按照微软的电子邮件通知进行注册。微软系统发出到货确认函邮件（Order Confirmation）即为合同的约定产品。乙方无有形实物交付甲方，甲方或最终用户收到微软电子邮件即为产品交付的完成。
（2）纸质授权（license）形式：本合同标的物的交付形式为原厂包装的纸质license，甲方收到乙方或者对应产品生产厂商交付的该纸质license即为交付完成。
（3）有形实物形式：甲方收到乙方交付的本合同标物即为交付完成。
3、双方承诺：本合同标的物的风险自甲方收货之日起转移至甲方。本合同项下标的物为专门为甲方（或甲方指定的最终用户）所订制，不具有转售其他客户的条件，除非货物生产厂商书面同意，否则双方一致认可：本合同约定的所有标的货物不得退货。 
*关键点： 不得退货条款*
""",
"""
三、产品的验收
验收时间：收到标的物的 5 个工作日内完成验收
验收异议期：收到标的物后10个工作日内，逾期提出的，视为已经收到本合同项下全部标的物且验收合格。

条款描述示例如下：
1、本合同约定产品的验收方式为：[　  ]
（1）甲方应自乙方下单之日起5个工作日内在网上完成产品的验收，并签署乙方提供的货物签收单，以快递或传真等形式回传至乙方。
（2）甲方应在收到标的物的 5 个工作日内完成验收，并签署乙方提供的货物签收单，以快递或传真等方式回传至乙方。
2、甲方收到标的物后，对于存在异议或认为不符合合同约定的，应在收货10个工作日内向乙方提出书面异议，逾期提出的，视为已经收到本合同项下全部标的物且验收合格。
""",
"""
四、违约责任
  甲方逾期付款的违约责任一定要有，日违约金的计算公式为：合同总金额*0.3%（如果  是甲方合同模板，我方逾期交货的违约责任和甲方逾期付款的违约责任要对等）

条款描述示例如下：
1、甲乙双方应全面实际地履行合同，一方迟延履行合同或履行合同不符合本合同约定的视为违约，违约方应向守约方支付违约金。双方一致认可：本合同所涉及行业的产品贬值迅速且在本合同签约价格中已经充分考虑了相关因素，为了体现对于违约方的惩罚性以及对于意思自治原则的充分尊重，双方一致承诺并保证：守约方已经产生了不少于本合同约定数额的实际损失（例如包括但不限于：资金周转成本、机会成本、催收成本、风险性成本等），违约方认可本合同守约方对于实际损失的举证责任困难，并明确放弃针对违约金过高的所有抗辩权。
*关键点：可以允许违约方应向守约方支付违约金但是不能高于合同金额的20%, 如果提到了违约金的具体数额金额的比例可以忽略和违约金比例可设置在千分之三至万分之五之间之间的冲突*

2、乙方未按合同规定的日期交货、提供服务，每延迟一天需按合同总金额的0.3%向甲方交纳违约金。
*关键点：违约金比例可设置在千分之三至万分之五之间*

3、甲方拒绝接受或迟延接受乙方符合合同约定的产品、服务或者甲方未按合同规定的付款日期付款，每延迟一天需按合同总金额的0.3%向乙方支付违约金。
*关键点：违约金比例可设置在千分之三至万分之五之间* 

4、如因甲方原因（包括但不限于未具备实施服务前的环境条件、调整实施服务项目的内容等）导致乙方延期完成服务的，乙方不承担本条第2款的违约责任
""",
"""
五、争议解决方式
优先选择北京市石景山区人民法院，选择北京市的其他法院我方也可以接受。如甲方为非北京市公司，选择原告所在地法院。
条款描述示例如下：
甲乙双方应友好协商解决与合同或合同执行有关的任何争议。如未能友好解决，任何一方均可向北京市石景山区人民法院提起诉讼。 
*关键点：公司要求诉讼方式：如未能友好解决，任何一方均可提交至原告住所地有管辖权的人民法院诉讼*

甲乙双方应友好协商解决与合同或合同执行有关的任何争议。如未能友好解决，任何一方均应提交至中国国际经济贸易仲裁委员会，按照现行有效的仲裁规则在北京进行仲裁，仲裁裁决是终局的，对双方均有约束力。
*关键点：如有此条款需抓取出来，我司仅接受诉讼方式* 
"""
]